In [2]:
import pandas as pd

In [5]:
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})

In [6]:
print(data)

[[1, 3], [2, 1]]

In [14]:
print(orders)

   id  customerId
0   1           3
1   2           1

In [15]:
print(customers)

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [19]:
df = customers[~customers['id'].isin(orders['customerId'])]
df

   id   name
1   2  Henry
3   4    Max

In [12]:
df[['name']].rename(columns = {'name':'Customers'})

  Customers
1     Henry
3       Max

In [20]:
data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})

In [21]:
print(views)

   article_id  author_id  viewer_id  view_date
0           1          3          5 2019-08-01
1           1          3          6 2019-08-02
2           2          7          7 2019-08-01
3           2          7          6 2019-08-02
4           4          7          1 2019-07-22
5           3          4          4 2019-07-21
6           3          4          4 2019-07-21

In [28]:
df = views[views['author_id'] == views['viewer_id']].drop_duplicates()[['author_id']].rename(columns = {'author_id':'id'}).sort_values(by=['id'])
df

   id
5   4
2   7

In [29]:
data = [[1, 'Let us Code'], [2, 'More than fifteen chars are here!']]
tweets = pd.DataFrame(data, columns=['tweet_id', 'content']).astype({'tweet_id':'Int64', 'content':'object'})

In [37]:
tweets[tweets['content'].str.len()>15][['tweet_id']]

   tweet_id
1         2

In [3]:
data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [7, 'Addilyn', 7400], [8, 'Juan', 6100], [9, 'Kannon', 7700]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})

In [14]:
employees['bonus'] = 0

In [19]:
employees.loc[(employees['employee_id'] % 2 != 0) & (~employees['name'].str.startswith('M')),'bonus'] = employees['salary']

In [20]:
employees

   employee_id     name  salary  bonus
0            2     Meir    3000      0
1            3  Michael    3800      0
2            7  Addilyn    7400   7400
3            8     Juan    6100      0
4            9   Kannon    7700   7700

In [21]:
result_df = employees[['employee_id', 'bonus']].sort_values(by='employee_id', ascending=True)

In [22]:
data = [[1, 'aLice'], [2, 'bOB']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})

In [23]:
users['name'] = users['name'].str.title()

In [24]:
users

   user_id   name
0        1  Alice
1        2    Bob